app/views/magazines/_form.html.erb

SELECT "oenologists".* FROM "oenologists"
SELECT "job_titles".* FROM "job_titles"
---

    <% Oenologist.all.each do |o| %>
      <%= o.name %>
      <%= form.collection_check_boxes(:job_title_ids, JobTitle.all, :id, :name) do |b| %>