app/views/oenologist_scores/_form.html.erb

SELECT "oenologists".* FROM "oenologists" ORDER BY "oenologists"."age" DESC
---
    <%= form.label :oenologist_id %>
    <%= form.collection_select :oenologist_id, Oenologist.all.order(age: :desc), :id, :name, class: 'input' %>

SELECT "wines".* FROM "wines"
---
    <%= form.label :wine_id %>
    <%= form.collection_select :wine_id, Wine.all, :id, :name, class: 'input' %>