app/views/oenologist_scores/index.html.erb

SELECT "strains".* FROM "strains" INNER JOIN "wine_strains" ON "strains"."id" = "wine_strains"."strain_id" WHERE "wine_strains"."wine_id" = ? ORDER BY "strains"."name" ASC  [["wine_id", 1]]
---
        <td><%= oenologist_score.wine.name %></td>
        <td><%= oenologist_score.wine.strains.order(:name).map{ |s| "#{s.name} (#{oenologist_score.wine.getPercentByStrain(s.id)})" }.join(', ') %></td>