app/views/oenologists/index.html.erb

SELECT "oenologists".* FROM "oenologists"
SELECT "magazineoenologistjobtitles".* FROM "magazineoenologistjobtitles" WHERE "magazineoenologistjobtitles"."oenologist_id" = ?  [["oenologist_id", 1]]
---
        <td>
          <% oenologist.magazineoenologistjobtitles.each do |mot| %>