app/controllers/wines_controller.rb

INSERT INTO "wines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Vino_01"], ["created_at", "2021-08-31 18:10:48.533392"], ["updated_at", "2021-08-31 18:10:48.533392"]]
---
  def create
    @wine = Wine.new(wine_params)

    respond_to do |format|
      if @wine.save

UPDATE "wines" SET "score" = ?, "updated_at" = ? WHERE "wines"."id" = ?  [["score", 55], ["updated_at", "2021-09-01 21:17:54.974730"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @wine.update(wine_params)

SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_wine
      @wine = Wine.find(params[:id])