app/models/magazine.rb

SELECT  "oenologists".* FROM "oenologists" WHERE "oenologists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "job_titles".* FROM "job_titles" WHERE "job_titles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "magazineoenologistjobtitles" ("magazine_id", "oenologist_id", "job_title_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["magazine_id", 1], ["oenologist_id", 1], ["job_title_id", 3], ["created_at", "2021-08-31 18:31:18.581539"], ["updated_at", "2021-08-31 18:31:18.581539"]]
---
    def addJobTitlesAndOenologists(oenologist_id_list)
        self.magazineoenologistjobtitles.destroy_all
        oenologist_id_list.each do |oenologist_id, job_title_ids|
            oenologist = Oenologist.find(oenologist_id)
            job_title_ids[:job_title_ids].each do |job_title_id|
                job_title = JobTitle.find(job_title_id)
                magazineoenologistjobtitles = Magazineoenologistjobtitle.new
                    magazineoenologistjobtitles.magazine_id = self.id
                    magazineoenologistjobtitles.oenologist_id = oenologist.id
                    magazineoenologistjobtitles.job_title_id = job_title.id
                magazineoenologistjobtitles.save

SELECT COUNT(*) FROM "magazineoenologistjobtitles" WHERE "magazineoenologistjobtitles"."magazine_id" = ? AND "magazineoenologistjobtitles"."oenologist_id" = ? AND "magazineoenologistjobtitles"."job_title_id" = ?  [["magazine_id", 1], ["oenologist_id", 1], ["job_title_id", 1]]
---
    def isOenologistThisJobTitle(o_id, jt_id)
        magazineoenologistjobtitles = Magazineoenologistjobtitle.where(magazine_id: self.id, oenologist_id: o_id, job_title_id: jt_id)
        if magazineoenologistjobtitles.count == 1