app/models/wine.rb

    def addStrainPercent(strainPercents)
        # {"1"=>"10", "2"=>"90", "3"=>""}
        self.wine_strains.destroy_all
        strainPercents.each do |strainId, strainPercentage|
            if strainPercentage != ""
                self.wine_strains.create(strain_id: strainId, percentage: strainPercentage)
---
DELETE FROM "wine_strains" WHERE "wine_strains"."id" = ?  [["id", 1]]
INSERT INTO "wine_strains" ("wine_id", "strain_id", "percentage", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["wine_id", 1], ["strain_id", 1], ["percentage", 10], ["created_at", "2021-08-31 18:10:48.576593"], ["updated_at", "2021-08-31 18:10:48.576593"]]

    def getPercentByStrain(strainId)
        self.wine_strains.find_by(strain_id: strainId) ? self.wine_strains.find_by(strain_id: strainId).percentage : 0
---
SELECT  "wine_strains".* FROM "wine_strains" WHERE "wine_strains"."wine_id" = ? AND "wine_strains"."strain_id" = ? LIMIT ?  [["wine_id", 1], ["strain_id", 1], ["LIMIT", 1]]