app/views/wines/_form.html.erb

SELECT "strains".* FROM "strains" WHERE "strains"."available" = ?  [["available", 1]]
---
  <%= form.label :strains %>
    <%= form.collection_check_boxes(:strain_ids, Strain.where(:available => true), :id, :name) do |b| %>

SELECT  "wine_strains".* FROM "wine_strains" WHERE "wine_strains"."wine_id" = ? AND "wine_strains"."strain_id" = ? LIMIT ?  [["wine_id", 1], ["strain_id", 1], ["LIMIT", 1]]
---
      <%= b.check_box + b.text %>
      <%= text_field("wine[strains_percent]", b.value, value: @wine.getPercentByStrain(b.value)) %>