app/views/wines/index.html.erb

        <td><%= wine.name %></td>
        <td><%= wine.strains.order(:name).map{ |s| "#{s.name} (#{wine.getPercentByStrain(s.id)})" }.join(', ') %></td>
---
SELECT "strains".* FROM "strains" INNER JOIN "wine_strains" ON "strains"."id" = "wine_strains"."strain_id" WHERE "wine_strains"."wine_id" = ? ORDER BY "strains"."name" ASC  [["wine_id", 1]]

          <% if wine.oenologist_scores %>
            <% wine.oenologist_scores.order(age: :desc).each do |score| %>
---
SELECT "oenologist_scores".* FROM "oenologist_scores" WHERE "oenologist_scores"."wine_id" = ? ORDER BY "age" DESC  [["wine_id", 1]]