app/views/wines/show.html.erb

  <strong>Oenologists' Score:</strong>
  <% @wine.oenologist_scores.order(age: :desc).each do |score| %>
---
SELECT "oenologist_scores".* FROM "oenologist_scores" WHERE "oenologist_scores"."wine_id" = ? ORDER BY "age" DESC  [["wine_id", 1]]